pesaventoeil/rd-riop/common/m33/board/pin_mux.h
/*
 * Copyright 2024-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_AON_19 (coord D5), LPUART1_CTS */
/* Routed pin properties */
#define LPUART1_CTS_PERIPHERAL                                           LPUART1   /*!< Peripheral name */
#define LPUART1_CTS_SIGNAL                                                 CTS_B   /*!< Signal name */

/* GPIO_AON_20 (coord E5), LPUART1_RTS */
/* Routed pin properties */
#define LPUART1_RTS_PERIPHERAL                                           LPUART1   /*!< Peripheral name */
#define LPUART1_RTS_SIGNAL                                                 RTS_B   /*!< Signal name */

/* GPIO_AON_08 (coord B1), LPUART1_TX */
/* Routed pin properties */
#define LPUART1_TX_PERIPHERAL                                            LPUART1   /*!< Peripheral name */
#define LPUART1_TX_SIGNAL                                                    TXD   /*!< Signal name */

/* GPIO_AON_09 (coord A5), LPUART1_RX */
/* Routed pin properties */
#define LPUART1_RX_PERIPHERAL                                            LPUART1   /*!< Peripheral name */
#define LPUART1_RX_SIGNAL                                                    RXD   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_LPUART1_RS485_Pins(void);     /* Function assigned for the Cortex-M33 */

/* GPIO_EMC_B2_17 (coord U7), RXD0 */
/* Routed pin properties */
#define NETC_ENETC0_RXD0_PERIPHERAL                             NETC_ENETC0_ETH4   /*!< Peripheral name */
#define NETC_ENETC0_RXD0_SIGNAL                                          RX_DATA   /*!< Signal name */
#define NETC_ENETC0_RXD0_CHANNEL                                              0U   /*!< Signal channel */

/* GPIO_EMC_B2_18 (coord P8), RXD1 */
/* Routed pin properties */
#define NETC_ENETC0_RXD1_PERIPHERAL                             NETC_ENETC0_ETH4   /*!< Peripheral name */
#define NETC_ENETC0_RXD1_SIGNAL                                          RX_DATA   /*!< Signal name */
#define NETC_ENETC0_RXD1_CHANNEL                                              1U   /*!< Signal channel */

/* GPIO_EMC_B2_10 (coord U6), RXD2 */
/* Routed pin properties */
#define NETC_ENETC0_RXD2_PERIPHERAL                             NETC_ENETC0_ETH4   /*!< Peripheral name */
#define NETC_ENETC0_RXD2_SIGNAL                                          RX_DATA   /*!< Signal name */
#define NETC_ENETC0_RXD2_CHANNEL                                              2U   /*!< Signal channel */

/* GPIO_EMC_B2_09 (coord U5), RXD3 */
/* Routed pin properties */
#define NETC_ENETC0_RXD3_PERIPHERAL                             NETC_ENETC0_ETH4   /*!< Peripheral name */
#define NETC_ENETC0_RXD3_SIGNAL                                          RX_DATA   /*!< Signal name */
#define NETC_ENETC0_RXD3_CHANNEL                                              3U   /*!< Signal channel */

/* GPIO_EMC_B2_19 (coord U8), RXEN */
/* Routed pin properties */
#define NETC_ENETC0_RXEN_PERIPHERAL                             NETC_ENETC0_ETH4   /*!< Peripheral name */
#define NETC_ENETC0_RXEN_SIGNAL                                            RX_EN   /*!< Signal name */

/* GPIO_EMC_B2_08 (coord U4), RXCLK */
/* Routed pin properties */
#define NETC_ENETC0_RXCLK_PERIPHERAL                            NETC_ENETC0_ETH4   /*!< Peripheral name */
#define NETC_ENETC0_RXCLK_SIGNAL                                          RX_CLK   /*!< Signal name */

/* GPIO_EMC_B2_13 (coord R6), TXD0 */
/* Routed pin properties */
#define NETC_ENETC0_TXD0_PERIPHERAL                             NETC_ENETC0_ETH4   /*!< Peripheral name */
#define NETC_ENETC0_TXD0_SIGNAL                                          TX_DATA   /*!< Signal name */
#define NETC_ENETC0_TXD0_CHANNEL                                              0U   /*!< Signal channel */

/* GPIO_EMC_B2_14 (coord N8), TXD1 */
/* Routed pin properties */
#define NETC_ENETC0_TXD1_PERIPHERAL                             NETC_ENETC0_ETH4   /*!< Peripheral name */
#define NETC_ENETC0_TXD1_SIGNAL                                          TX_DATA   /*!< Signal name */
#define NETC_ENETC0_TXD1_CHANNEL                                              1U   /*!< Signal channel */

/* GPIO_EMC_B2_12 (coord R5), TXD2 */
/* Routed pin properties */
#define NETC_ENETC0_TXD2_PERIPHERAL                             NETC_ENETC0_ETH4   /*!< Peripheral name */
#define NETC_ENETC0_TXD2_SIGNAL                                          TX_DATA   /*!< Signal name */
#define NETC_ENETC0_TXD2_CHANNEL                                              2U   /*!< Signal channel */

/* GPIO_EMC_B2_11 (coord P6), TXD3 */
/* Routed pin properties */
#define NETC_ENETC0_TXD3_PERIPHERAL                             NETC_ENETC0_ETH4   /*!< Peripheral name */
#define NETC_ENETC0_TXD3_SIGNAL                                          TX_DATA   /*!< Signal name */
#define NETC_ENETC0_TXD3_CHANNEL                                              3U   /*!< Signal channel */

/* GPIO_EMC_B2_15 (coord R4), TXEN */
/* Routed pin properties */
#define NETC_ENETC0_TXEN_PERIPHERAL                             NETC_ENETC0_ETH4   /*!< Peripheral name */
#define NETC_ENETC0_TXEN_SIGNAL                                            TX_EN   /*!< Signal name */

/* GPIO_EMC_B2_16 (coord R7), TXCLK */
/* Routed pin properties */
#define NETC_ENETC0_TXCLK_PERIPHERAL                            NETC_ENETC0_ETH4   /*!< Peripheral name */
#define NETC_ENETC0_TXCLK_SIGNAL                                          TX_CLK   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_NETC_ENETC0_ETH4_RGMII_Pins(void); /* Function assigned for the Cortex-M33 */

