pesaventoeil/rd-riop/common/m33/board/pin_mux.h
/* GPIO_EMC_B2_00 (coord N5), EMDC */
/* Routed pin properties */
#define NETC_ETH4_EMDC_PERIPHERAL                                           NETC   /*!< Peripheral name */
#define NETC_ETH4_EMDC_SIGNAL                                          netc_emdc   /*!< Signal name */

/* GPIO_EMC_B2_01 (coord R2), EMDIO */
/* Routed pin properties */
#define NETC_ETH4_EMDIO_PERIPHERAL                                          NETC   /*!< Peripheral name */
#define NETC_ETH4_EMDIO_SIGNAL                                        netc_emdio   /*!< Signal name */

/* GPIO_EMC_B2_03 (coord T5), RESET */
/* Routed pin properties */
#define NETC_ETH4_RESET_PERIPHERAL                                        RGPIO3   /*!< Peripheral name */
#define NETC_ETH4_RESET_SIGNAL                                           gpio_io   /*!< Signal name */
#define NETC_ETH4_RESET_CHANNEL                                              13U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define NETC_ETH4_RESET_GPIO                                              RGPIO3   /*!< GPIO peripheral base pointer */
#define NETC_ETH4_RESET_INIT_GPIO_VALUE                                       1U   /*!< GPIO output initial state */
#define NETC_ETH4_RESET_GPIO_PIN                                             13U   /*!< GPIO pin number */
#define NETC_ETH4_RESET_GPIO_PIN_MASK                                (1U << 13U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_NETC_ENETC0_ETH4_PHY_Config_Pins(void); /* Function assigned for the Cortex-M33 */

/* GPIO_EMC_B1_02 (coord K2), RXCLK */
/* Routed pin properties */
#define NETC_SWT_ETH3_RXCLK_PERIPHERAL                             NETC_SWT_ETH3   /*!< Peripheral name */
#define NETC_SWT_ETH3_RXCLK_SIGNAL                                        RX_CLK   /*!< Signal name */

/* GPIO_EMC_B1_09 (coord E1), RXD0 */
/* Routed pin properties */
#define NETC_SWT_ETH3_RXD0_PERIPHERAL                              NETC_SWT_ETH3   /*!< Peripheral name */
#define NETC_SWT_ETH3_RXD0_SIGNAL                                        RX_DATA   /*!< Signal name */
#define NETC_SWT_ETH3_RXD0_CHANNEL                                            0U   /*!< Signal channel */

/* GPIO_EMC_B1_10 (coord E3), RXD1 */
/* Routed pin properties */
#define NETC_SWT_ETH3_RXD1_PERIPHERAL                              NETC_SWT_ETH3   /*!< Peripheral name */
#define NETC_SWT_ETH3_RXD1_SIGNAL                                        RX_DATA   /*!< Signal name */
#define NETC_SWT_ETH3_RXD1_CHANNEL                                            1U   /*!< Signal channel */

/* GPIO_EMC_B1_04 (coord J4), RXD2 */
/* Routed pin properties */
#define NETC_SWT_ETH3_RXD2_PERIPHERAL                              NETC_SWT_ETH3   /*!< Peripheral name */
#define NETC_SWT_ETH3_RXD2_SIGNAL                                        RX_DATA   /*!< Signal name */
#define NETC_SWT_ETH3_RXD2_CHANNEL                                            2U   /*!< Signal channel */

/* GPIO_EMC_B1_03 (coord G3), RXD3 */
/* Routed pin properties */
#define NETC_SWT_ETH3_RXD3_PERIPHERAL                              NETC_SWT_ETH3   /*!< Peripheral name */
#define NETC_SWT_ETH3_RXD3_SIGNAL                                        RX_DATA   /*!< Signal name */
#define NETC_SWT_ETH3_RXD3_CHANNEL                                            3U   /*!< Signal channel */

/* GPIO_EMC_B1_11 (coord F2), RXEN */
/* Routed pin properties */
#define NETC_SWT_ETH3_RXEN_PERIPHERAL                              NETC_SWT_ETH3   /*!< Peripheral name */
#define NETC_SWT_ETH3_RXEN_SIGNAL                                          RX_EN   /*!< Signal name */

/* GPIO_EMC_B1_08 (coord H5), TXCLK */
/* Routed pin properties */
#define NETC_SWT_ETH3_TXCLK_PERIPHERAL                             NETC_SWT_ETH3   /*!< Peripheral name */
#define NETC_SWT_ETH3_TXCLK_SIGNAL                                        TX_CLK   /*!< Signal name */

/* GPIO_EMC_B1_05 (coord H6), TXD0 */
/* Routed pin properties */
#define NETC_SWT_ETH3_TXD0_PERIPHERAL                              NETC_SWT_ETH3   /*!< Peripheral name */
#define NETC_SWT_ETH3_TXD0_SIGNAL                                        TX_DATA   /*!< Signal name */
#define NETC_SWT_ETH3_TXD0_CHANNEL                                            0U   /*!< Signal channel */

/* GPIO_EMC_B1_06 (coord K3), TXD1 */
/* Routed pin properties */
#define NETC_SWT_ETH3_TXD1_PERIPHERAL                              NETC_SWT_ETH3   /*!< Peripheral name */
#define NETC_SWT_ETH3_TXD1_SIGNAL                                        TX_DATA   /*!< Signal name */
#define NETC_SWT_ETH3_TXD1_CHANNEL                                            1U   /*!< Signal channel */

/* GPIO_EMC_B1_01 (coord H4), TXD2 */
/* Routed pin properties */
#define NETC_SWT_ETH3_TXD2_PERIPHERAL                              NETC_SWT_ETH3   /*!< Peripheral name */
#define NETC_SWT_ETH3_TXD2_SIGNAL                                        TX_DATA   /*!< Signal name */
#define NETC_SWT_ETH3_TXD2_CHANNEL                                            2U   /*!< Signal channel */

/* GPIO_EMC_B1_00 (coord H3), TXD3 */
/* Routed pin properties */
#define NETC_SWT_ETH3_TXD3_PERIPHERAL                              NETC_SWT_ETH3   /*!< Peripheral name */
#define NETC_SWT_ETH3_TXD3_SIGNAL                                        TX_DATA   /*!< Signal name */
#define NETC_SWT_ETH3_TXD3_CHANNEL                                            3U   /*!< Signal channel */

/* GPIO_EMC_B1_07 (coord M3), TXEN */
/* Routed pin properties */
#define NETC_SWT_ETH3_TXEN_PERIPHERAL                              NETC_SWT_ETH3   /*!< Peripheral name */
#define NETC_SWT_ETH3_TXEN_SIGNAL                                          TX_EN   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_NETC_SWT_ETH3_RGMII_Pins(void); /* Function assigned for the Cortex-M33 */

/* GPIO_B2_13 (coord B8), RXCLK */
/* Routed pin properties */
#define NETC_SWT_ETH2_RXCLK_PERIPHERAL                             NETC_SWT_ETH2   /*!< Peripheral name */
#define NETC_SWT_ETH2_RXCLK_SIGNAL                                        RX_CLK   /*!< Signal name */

/* GPIO_B2_10 (coord A10), RXD0 */
/* Routed pin properties */
#define NETC_SWT_ETH2_RXD0_PERIPHERAL                              NETC_SWT_ETH2   /*!< Peripheral name */
#define NETC_SWT_ETH2_RXD0_SIGNAL                                        RX_DATA   /*!< Signal name */
#define NETC_SWT_ETH2_RXD0_CHANNEL                                            0U   /*!< Signal channel */

/* GPIO_B2_11 (coord B9), RXD1 */
/* Routed pin properties */
#define NETC_SWT_ETH2_RXD1_PERIPHERAL                              NETC_SWT_ETH2   /*!< Peripheral name */
#define NETC_SWT_ETH2_RXD1_SIGNAL                                        RX_DATA   /*!< Signal name */
#define NETC_SWT_ETH2_RXD1_CHANNEL                                            1U   /*!< Signal channel */

/* GPIO_B2_02 (coord C10), RXD2 */
/* Routed pin properties */
#define NETC_SWT_ETH2_RXD2_PERIPHERAL                              NETC_SWT_ETH2   /*!< Peripheral name */
#define NETC_SWT_ETH2_RXD2_SIGNAL                                        RX_DATA   /*!< Signal name */
#define NETC_SWT_ETH2_RXD2_CHANNEL                                            2U   /*!< Signal channel */

/* GPIO_B2_03 (coord D9), RXD3 */
/* Routed pin properties */
#define NETC_SWT_ETH2_RXD3_PERIPHERAL                              NETC_SWT_ETH2   /*!< Peripheral name */
#define NETC_SWT_ETH2_RXD3_SIGNAL                                        RX_DATA   /*!< Signal name */
#define NETC_SWT_ETH2_RXD3_CHANNEL                                            3U   /*!< Signal channel */

