pesaventoeil/rd-riop/common/m33/board/pin_mux.h
/* GPIO_B2_12 (coord A8), RXEN */
/* Routed pin properties */
#define NETC_SWT_ETH2_RXEN_PERIPHERAL                              NETC_SWT_ETH2   /*!< Peripheral name */
#define NETC_SWT_ETH2_RXEN_SIGNAL                                          RX_EN   /*!< Signal name */

/* GPIO_B2_09 (coord D10), TXCLK */
/* Routed pin properties */
#define NETC_SWT_ETH2_TXCLK_PERIPHERAL                             NETC_SWT_ETH2   /*!< Peripheral name */
#define NETC_SWT_ETH2_TXCLK_SIGNAL                                        TX_CLK   /*!< Signal name */

/* GPIO_B2_06 (coord E8), TXD0 */
/* Routed pin properties */
#define NETC_SWT_ETH2_TXD0_PERIPHERAL                              NETC_SWT_ETH2   /*!< Peripheral name */
#define NETC_SWT_ETH2_TXD0_SIGNAL                                        TX_DATA   /*!< Signal name */
#define NETC_SWT_ETH2_TXD0_CHANNEL                                            0U   /*!< Signal channel */

/* GPIO_B2_07 (coord A6), TXD1 */
/* Routed pin properties */
#define NETC_SWT_ETH2_TXD1_PERIPHERAL                              NETC_SWT_ETH2   /*!< Peripheral name */
#define NETC_SWT_ETH2_TXD1_SIGNAL                                        TX_DATA   /*!< Signal name */
#define NETC_SWT_ETH2_TXD1_CHANNEL                                            1U   /*!< Signal channel */

/* GPIO_B2_04 (coord C9), TXD2 */
/* Routed pin properties */
#define NETC_SWT_ETH2_TXD2_PERIPHERAL                              NETC_SWT_ETH2   /*!< Peripheral name */
#define NETC_SWT_ETH2_TXD2_SIGNAL                                        TX_DATA   /*!< Signal name */
#define NETC_SWT_ETH2_TXD2_CHANNEL                                            2U   /*!< Signal channel */

/* GPIO_B2_05 (coord A9), TXD3 */
/* Routed pin properties */
#define NETC_SWT_ETH2_TXD3_PERIPHERAL                              NETC_SWT_ETH2   /*!< Peripheral name */
#define NETC_SWT_ETH2_TXD3_SIGNAL                                        TX_DATA   /*!< Signal name */
#define NETC_SWT_ETH2_TXD3_CHANNEL                                            3U   /*!< Signal channel */

/* GPIO_B2_08 (coord A7), TXEN */
/* Routed pin properties */
#define NETC_SWT_ETH2_TXEN_PERIPHERAL                              NETC_SWT_ETH2   /*!< Peripheral name */
#define NETC_SWT_ETH2_TXEN_SIGNAL                                          TX_EN   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_NETC_SWT_ETH2_RGMII_Pins(void); /* Function assigned for the Cortex-M33 */

/* GPIO_AD_30 (coord L17), EMDC */
/* Routed pin properties */
#define NETC_ETH2_ETH3_EMDC_PERIPHERAL                                      NETC   /*!< Peripheral name */
#define NETC_ETH2_ETH3_EMDC_SIGNAL                                     netc_emdc   /*!< Signal name */

/* GPIO_SD_B1_02 (coord D14), RESET */
/* Routed pin properties */
#define NETC_ETH2_ETH3_RESET_PERIPHERAL                                   RGPIO5   /*!< Peripheral name */
#define NETC_ETH2_ETH3_RESET_SIGNAL                                      gpio_io   /*!< Signal name */
#define NETC_ETH2_ETH3_RESET_CHANNEL                                          6U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define NETC_ETH2_ETH3_RESET_GPIO                                         RGPIO5   /*!< GPIO peripheral base pointer */
#define NETC_ETH2_ETH3_RESET_INIT_GPIO_VALUE                                  0U   /*!< GPIO output initial state */
#define NETC_ETH2_ETH3_RESET_GPIO_PIN                                         6U   /*!< GPIO pin number */
#define NETC_ETH2_ETH3_RESET_GPIO_PIN_MASK                            (1U << 6U)   /*!< GPIO pin mask */

/* GPIO_AD_31 (coord K17), EMDIO */
/* Routed pin properties */
#define NETC_ETH2_ETH3_EMDIO_PERIPHERAL                                     NETC   /*!< Peripheral name */
#define NETC_ETH2_ETH3_EMDIO_SIGNAL                                   netc_emdio   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_NETC_ETH2_ETH3_PHY_Config_Pins(void); /* Function assigned for the Cortex-M33 */

/* GPIO_EMC_B1_09 (coord E1), RXD0 */
/* Routed pin properties */
#define ECAT_PT0_RXD0_PERIPHERAL                                            ECAT   /*!< Peripheral name */
#define ECAT_PT0_RXD0_SIGNAL                                             PT0_RXD   /*!< Signal name */
#define ECAT_PT0_RXD0_CHANNEL                                                 0U   /*!< Signal channel */

/* GPIO_EMC_B1_10 (coord E3), RXD1 */
/* Routed pin properties */
#define ECAT_PT0_RXD1_PERIPHERAL                                            ECAT   /*!< Peripheral name */
#define ECAT_PT0_RXD1_SIGNAL                                             PT0_RXD   /*!< Signal name */
#define ECAT_PT0_RXD1_CHANNEL                                                 1U   /*!< Signal channel */

/* GPIO_EMC_B1_04 (coord J4), RXD2 */
/* Routed pin properties */
#define ECAT_PT0_RXD2_PERIPHERAL                                            ECAT   /*!< Peripheral name */
#define ECAT_PT0_RXD2_SIGNAL                                             PT0_RXD   /*!< Signal name */
#define ECAT_PT0_RXD2_CHANNEL                                                 2U   /*!< Signal channel */

/* GPIO_EMC_B1_03 (coord G3), RXD3 */
/* Routed pin properties */
#define ECAT_PT0_RXD3_PERIPHERAL                                            ECAT   /*!< Peripheral name */
#define ECAT_PT0_RXD3_SIGNAL                                             PT0_RXD   /*!< Signal name */
#define ECAT_PT0_RXD3_CHANNEL                                                 3U   /*!< Signal channel */

/* GPIO_EMC_B1_02 (coord K2), RXCLK */
/* Routed pin properties */
#define ECAT_PT0_RXCLK_PERIPHERAL                                           ECAT   /*!< Peripheral name */
#define ECAT_PT0_RXCLK_SIGNAL                                         PT0_RX_CLK   /*!< Signal name */

/* GPIO_EMC_B1_11 (coord F2), RXEN */
/* Routed pin properties */
#define ECAT_PT0_RXEN_PERIPHERAL                                            ECAT   /*!< Peripheral name */
#define ECAT_PT0_RXEN_SIGNAL                                           PT0_RX_DV   /*!< Signal name */

/* GPIO_EMC_B1_12 (coord G6), RXER */
/* Routed pin properties */
#define ECAT_PT0_RXER_PERIPHERAL                                            ECAT   /*!< Peripheral name */
#define ECAT_PT0_RXER_SIGNAL                                           PT0_RX_ER   /*!< Signal name */

/* GPIO_EMC_B1_08 (coord H5), TXCLK */
/* Routed pin properties */
#define ECAT_PT0_TXCLK_PERIPHERAL                                           ECAT   /*!< Peripheral name */
#define ECAT_PT0_TXCLK_SIGNAL                                         PT0_TX_CLK   /*!< Signal name */

