pesaventoeil/rd-riop/common/m33/board/pin_mux.h
/* GPIO_EMC_B1_07 (coord M3), TXEN */
/* Routed pin properties */
#define ECAT_PT0_TXEN_PERIPHERAL                                            ECAT   /*!< Peripheral name */
#define ECAT_PT0_TXEN_SIGNAL                                           PT0_TX_EN   /*!< Signal name */

/* GPIO_EMC_B1_05 (coord H6), TXD0 */
/* Routed pin properties */
#define ECAT_PT0_TXD0_PERIPHERAL                                            ECAT   /*!< Peripheral name */
#define ECAT_PT0_TXD0_SIGNAL                                             PT0_TXD   /*!< Signal name */
#define ECAT_PT0_TXD0_CHANNEL                                                 0U   /*!< Signal channel */

/* GPIO_EMC_B1_06 (coord K3), TXD1 */
/* Routed pin properties */
#define ECAT_PT0_TXD1_PERIPHERAL                                            ECAT   /*!< Peripheral name */
#define ECAT_PT0_TXD1_SIGNAL                                             PT0_TXD   /*!< Signal name */
#define ECAT_PT0_TXD1_CHANNEL                                                 1U   /*!< Signal channel */

/* GPIO_EMC_B1_01 (coord H4), TXD2 */
/* Routed pin properties */
#define ECAT_PT0_TXD2_PERIPHERAL                                            ECAT   /*!< Peripheral name */
#define ECAT_PT0_TXD2_SIGNAL                                             PT0_TXD   /*!< Signal name */
#define ECAT_PT0_TXD2_CHANNEL                                                 2U   /*!< Signal channel */

/* GPIO_EMC_B1_00 (coord H3), TXD3 */
/* Routed pin properties */
#define ECAT_PT0_TXD3_PERIPHERAL                                            ECAT   /*!< Peripheral name */
#define ECAT_PT0_TXD3_SIGNAL                                             PT0_TXD   /*!< Signal name */
#define ECAT_PT0_TXD3_CHANNEL                                                 3U   /*!< Signal channel */

/* GPIO_AD_16 (coord N17), LINK_MII */
/* Routed pin properties */
#define ECAT_PT0_LINK_MII_PERIPHERAL                                        ECAT   /*!< Peripheral name */
#define ECAT_PT0_LINK_MII_SIGNAL                                        LINK_MII   /*!< Signal name */
#define ECAT_PT0_LINK_MII_CHANNEL                                             0U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_ECAT_PT0_MII_Pins(void);      /* Function assigned for the Cortex-M33 */

/* GPIO_B2_10 (coord A10), RXD0 */
/* Routed pin properties */
#define ECAT_PT1_RXD0_PERIPHERAL                                            ECAT   /*!< Peripheral name */
#define ECAT_PT1_RXD0_SIGNAL                                             PT1_RXD   /*!< Signal name */
#define ECAT_PT1_RXD0_CHANNEL                                                 0U   /*!< Signal channel */

/* GPIO_B2_11 (coord B9), RXD1 */
/* Routed pin properties */
#define ECAT_PT1_RXD1_PERIPHERAL                                            ECAT   /*!< Peripheral name */
#define ECAT_PT1_RXD1_SIGNAL                                             PT1_RXD   /*!< Signal name */
#define ECAT_PT1_RXD1_CHANNEL                                                 1U   /*!< Signal channel */

/* GPIO_B2_02 (coord C10), RXD2 */
/* Routed pin properties */
#define ECAT_PT1_RXD2_PERIPHERAL                                            ECAT   /*!< Peripheral name */
#define ECAT_PT1_RXD2_SIGNAL                                             PT1_RXD   /*!< Signal name */
#define ECAT_PT1_RXD2_CHANNEL                                                 2U   /*!< Signal channel */

/* GPIO_B2_03 (coord D9), RXD3 */
/* Routed pin properties */
#define ECAT_PT1_RXD3_PERIPHERAL                                            ECAT   /*!< Peripheral name */
#define ECAT_PT1_RXD3_SIGNAL                                             PT1_RXD   /*!< Signal name */
#define ECAT_PT1_RXD3_CHANNEL                                                 3U   /*!< Signal channel */

/* GPIO_B2_13 (coord B8), RXCLK */
/* Routed pin properties */
#define ECAT_PT1_RXCLK_PERIPHERAL                                           ECAT   /*!< Peripheral name */
#define ECAT_PT1_RXCLK_SIGNAL                                         PT1_RX_CLK   /*!< Signal name */

/* GPIO_B2_12 (coord A8), RXEN */
/* Routed pin properties */
#define ECAT_PT1_RXEN_PERIPHERAL                                            ECAT   /*!< Peripheral name */
#define ECAT_PT1_RXEN_SIGNAL                                           PT1_RX_DV   /*!< Signal name */

/* GPIO_B2_01 (coord E10), RXER */
/* Routed pin properties */
#define ECAT_PT1_RXER_PERIPHERAL                                            ECAT   /*!< Peripheral name */
#define ECAT_PT1_RXER_SIGNAL                                           PT1_RX_ER   /*!< Signal name */

/* GPIO_B2_09 (coord D10), TXCLK */
/* Routed pin properties */
#define ECAT_PT1_TXCLK_PERIPHERAL                                           ECAT   /*!< Peripheral name */
#define ECAT_PT1_TXCLK_SIGNAL                                         PT1_TX_CLK   /*!< Signal name */

/* GPIO_B2_08 (coord A7), TXEN */
/* Routed pin properties */
#define ECAT_PT1_TX_EN_PERIPHERAL                                           ECAT   /*!< Peripheral name */
#define ECAT_PT1_TX_EN_SIGNAL                                          PT1_TX_EN   /*!< Signal name */

/* GPIO_B2_06 (coord E8), TXD0 */
/* Routed pin properties */
#define ECAT_PT1_TXD0_PERIPHERAL                                            ECAT   /*!< Peripheral name */
#define ECAT_PT1_TXD0_SIGNAL                                             PT1_TXD   /*!< Signal name */
#define ECAT_PT1_TXD0_CHANNEL                                                 0U   /*!< Signal channel */

/* GPIO_B2_07 (coord A6), TXD1 */
/* Routed pin properties */
#define ECAT_PT1_TXD1_PERIPHERAL                                            ECAT   /*!< Peripheral name */
#define ECAT_PT1_TXD1_SIGNAL                                             PT1_TXD   /*!< Signal name */
#define ECAT_PT1_TXD1_CHANNEL                                                 1U   /*!< Signal channel */

/* GPIO_B2_04 (coord C9), TXD2 */
/* Routed pin properties */
#define ECAT_PT1_TXD2_PERIPHERAL                                            ECAT   /*!< Peripheral name */
#define ECAT_PT1_TXD2_SIGNAL                                             PT1_TXD   /*!< Signal name */
#define ECAT_PT1_TXD2_CHANNEL                                                 2U   /*!< Signal channel */

/* GPIO_B2_05 (coord A9), TXD3 */
/* Routed pin properties */
#define ECAT_PT1_TXD3_PERIPHERAL                                            ECAT   /*!< Peripheral name */
#define ECAT_PT1_TXD3_SIGNAL                                             PT1_TXD   /*!< Signal name */
#define ECAT_PT1_TXD3_CHANNEL                                                 3U   /*!< Signal channel */

/* GPIO_AD_17 (coord M17), LINK_MII */
/* Routed pin properties */
#define ECAT_PT1_LINK_MII_PERIPHERAL                                        ECAT   /*!< Peripheral name */
#define ECAT_PT1_LINK_MII_SIGNAL                                        LINK_MII   /*!< Signal name */
#define ECAT_PT1_LINK_MII_CHANNEL                                             1U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_ECAT_PT1_MII_Pins(void);      /* Function assigned for the Cortex-M33 */

/* GPIO_AD_30 (coord L17), EMDC */
/* Routed pin properties */
#define ECAT_PT0_PT1_EMDC_PERIPHERAL                                        ECAT   /*!< Peripheral name */
#define ECAT_PT0_PT1_EMDC_SIGNAL                                             MDC   /*!< Signal name */

/* GPIO_AD_31 (coord K17), EMDIO */
/* Routed pin properties */
#define ECAT_PT0_PT1_EMDIO_PERIPHERAL                                       ECAT   /*!< Peripheral name */
#define ECAT_PT0_PT1_EMDIO_SIGNAL                                           MDIO   /*!< Signal name */

/* GPIO_SD_B1_02 (coord D14), RESET */
/* Routed pin properties */
#define ECAT_PT0_PT1_RESET_PERIPHERAL                                     RGPIO5   /*!< Peripheral name */
#define ECAT_PT0_PT1_RESET_SIGNAL                                        gpio_io   /*!< Signal name */
#define ECAT_PT0_PT1_RESET_CHANNEL                                            6U   /*!< Signal channel */

