pesaventoeil/rd-riop/common/m33/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define ECAT_PT0_PT1_RESET_GPIO                                           RGPIO5   /*!< GPIO peripheral base pointer */
#define ECAT_PT0_PT1_RESET_INIT_GPIO_VALUE                                    0U   /*!< GPIO output initial state */
#define ECAT_PT0_PT1_RESET_GPIO_PIN                                           6U   /*!< GPIO pin number */
#define ECAT_PT0_PT1_RESET_GPIO_PIN_MASK                              (1U << 6U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_ECAT_PT0_PT1_PHY_Config_Pins(void); /* Function assigned for the Cortex-M33 */

/* GPIO_EMC_B1_39 (coord P1), FLEXSPI2_A_SS0_B */
/* Routed pin properties */
#define FLEXSPI2_A_SS0_B_PERIPHERAL                                     FLEXSPI2   /*!< Peripheral name */
#define FLEXSPI2_A_SS0_B_SIGNAL                                  FLEXSPI_A_SS0_B   /*!< Signal name */

/* GPIO_EMC_B1_41 (coord R1), FLEXSPI2_A_SCLK */
/* Routed pin properties */
#define FLEXSPI2_A_SCLK_PERIPHERAL                                      FLEXSPI2   /*!< Peripheral name */
#define FLEXSPI2_A_SCLK_SIGNAL                                    FLEXSPI_A_SCLK   /*!< Signal name */

/* GPIO_EMC_B1_34 (coord L2), FLEXSPI2_B_SCLK */
/* Routed pin properties */
#define FLEXSPI2_B_SCLK_PERIPHERAL                                      FLEXSPI2   /*!< Peripheral name */
#define FLEXSPI2_B_SCLK_SIGNAL                                    FLEXSPI_B_SCLK   /*!< Signal name */

/* GPIO_EMC_B1_40 (coord N2), FLEXSPI2_A_DQS */
/* Routed pin properties */
#define FLEXSPI2_A_DQS_PERIPHERAL                                       FLEXSPI2   /*!< Peripheral name */
#define FLEXSPI2_A_DQS_SIGNAL                                      FLEXSPI_A_DQS   /*!< Signal name */

/* GPIO_EMC_B1_35 (coord L1), FLEXSPI2_A_D0 */
/* Routed pin properties */
#define FLEXSPI2_A_D0_PERIPHERAL                                        FLEXSPI2   /*!< Peripheral name */
#define FLEXSPI2_A_D0_SIGNAL                                     FLEXSPI_A_DATA0   /*!< Signal name */

/* GPIO_EMC_B1_36 (coord M1), FLEXSPI2_A_D1 */
/* Routed pin properties */
#define FLEXSPI2_A_D1_PERIPHERAL                                        FLEXSPI2   /*!< Peripheral name */
#define FLEXSPI2_A_D1_SIGNAL                                     FLEXSPI_A_DATA1   /*!< Signal name */

/* GPIO_EMC_B1_37 (coord N1), FLEXSPI2_A_D2 */
/* Routed pin properties */
#define FLEXSPI2_A_D2_PERIPHERAL                                        FLEXSPI2   /*!< Peripheral name */
#define FLEXSPI2_A_D2_SIGNAL                                     FLEXSPI_A_DATA2   /*!< Signal name */

/* GPIO_EMC_B1_38 (coord M2), FLEXSPI2_A_D3 */
/* Routed pin properties */
#define FLEXSPI2_A_D3_PERIPHERAL                                        FLEXSPI2   /*!< Peripheral name */
#define FLEXSPI2_A_D3_SIGNAL                                     FLEXSPI_A_DATA3   /*!< Signal name */

/* GPIO_EMC_B1_33 (coord K1), FLEXSPI2_B_D0 */
/* Routed pin properties */
#define FLEXSPI2_B_D0_PERIPHERAL                                        FLEXSPI2   /*!< Peripheral name */
#define FLEXSPI2_B_D0_SIGNAL                                     FLEXSPI_B_DATA0   /*!< Signal name */

/* GPIO_EMC_B1_32 (coord J1), FLEXSPI2_B_D1 */
/* Routed pin properties */
#define FLEXSPI2_B_D1_PERIPHERAL                                        FLEXSPI2   /*!< Peripheral name */
#define FLEXSPI2_B_D1_SIGNAL                                     FLEXSPI_B_DATA1   /*!< Signal name */

/* GPIO_EMC_B1_31 (coord J2), FLEXSPI2_B_D2 */
/* Routed pin properties */
#define FLEXSPI2_B_D2_PERIPHERAL                                        FLEXSPI2   /*!< Peripheral name */
#define FLEXSPI2_B_D2_SIGNAL                                     FLEXSPI_B_DATA2   /*!< Signal name */

/* GPIO_EMC_B1_30 (coord H2), FLEXSPI2_B_D3 */
/* Routed pin properties */
#define FLEXSPI2_B_D3_PERIPHERAL                                        FLEXSPI2   /*!< Peripheral name */
#define FLEXSPI2_B_D3_SIGNAL                                     FLEXSPI_B_DATA3   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_FlexSPI2_HYPERRAM_Pins(void); /* Function assigned for the Cortex-M33 */

/* GPIO_AON_16 (coord C5), CAN1_TX */
/* Routed pin properties */
#define CAN1_TX_PERIPHERAL                                                  CAN1   /*!< Peripheral name */
#define CAN1_TX_SIGNAL                                                        TX   /*!< Signal name */

/* GPIO_AON_17 (coord D6), CAN1_RX */
/* Routed pin properties */
#define CAN1_RX_PERIPHERAL                                                  CAN1   /*!< Peripheral name */
#define CAN1_RX_SIGNAL                                                        RX   /*!< Signal name */

/* GPIO_AON_18 (coord E6), CAN1_STBY */
/* Routed pin properties */
#define CAN1_STBY_PERIPHERAL                                              RGPIO1   /*!< Peripheral name */
#define CAN1_STBY_SIGNAL                                                 gpio_io   /*!< Signal name */
#define CAN1_STBY_CHANNEL                                                    18U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define CAN1_STBY_GPIO                                                    RGPIO1   /*!< GPIO peripheral base pointer */
#define CAN1_STBY_INIT_GPIO_VALUE                                             0U   /*!< GPIO output initial state */
#define CAN1_STBY_GPIO_PIN                                                   18U   /*!< GPIO pin number */
#define CAN1_STBY_GPIO_PIN_MASK                                      (1U << 18U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_CAN1_Pins(void);              /* Function assigned for the Cortex-M33 */

/* GPIO_AON_15 (coord B3), LED_GREEN */
/* Routed pin properties */
#define LED_GREEN_PERIPHERAL                                              RGPIO1   /*!< Peripheral name */
#define LED_GREEN_SIGNAL                                                 gpio_io   /*!< Signal name */
#define LED_GREEN_CHANNEL                                                    15U   /*!< Signal channel */

