pesaventoeil/rd-riop/common/m33/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define LED_GREEN_GPIO                                                    RGPIO1   /*!< GPIO peripheral base pointer */
#define LED_GREEN_INIT_GPIO_VALUE                                             0U   /*!< GPIO output initial state */
#define LED_GREEN_GPIO_PIN                                                   15U   /*!< GPIO pin number */
#define LED_GREEN_GPIO_PIN_MASK                                      (1U << 15U)   /*!< GPIO pin mask */

/* GPIO_AON_03 (coord C8), LED_RED */
/* Routed pin properties */
#define LED_RED_PERIPHERAL                                                RGPIO1   /*!< Peripheral name */
#define LED_RED_SIGNAL                                                   gpio_io   /*!< Signal name */
#define LED_RED_CHANNEL                                                       3U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define LED_RED_GPIO                                                      RGPIO1   /*!< GPIO peripheral base pointer */
#define LED_RED_INIT_GPIO_VALUE                                               0U   /*!< GPIO output initial state */
#define LED_RED_GPIO_PIN                                                      3U   /*!< GPIO pin number */
#define LED_RED_GPIO_PIN_MASK                                         (1U << 3U)   /*!< GPIO pin mask */

/* GPIO_B2_00 (coord E9), USER_BUTTON */
/* Routed pin properties */
#define USER_BUTTON_PERIPHERAL                                            RGPIO6   /*!< Peripheral name */
#define USER_BUTTON_SIGNAL                                               gpio_io   /*!< Signal name */
#define USER_BUTTON_CHANNEL                                                  14U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define USER_BUTTON_GPIO                                                  RGPIO6   /*!< GPIO peripheral base pointer */
#define USER_BUTTON_GPIO_PIN                                                 14U   /*!< GPIO pin number */
#define USER_BUTTON_GPIO_PIN_MASK                                    (1U << 14U)   /*!< GPIO pin mask */

/* GPIO_AON_10 (coord B5), LED_BLUE */
/* Routed pin properties */
#define LED_BLUE_PERIPHERAL                                               RGPIO1   /*!< Peripheral name */
#define LED_BLUE_SIGNAL                                                  gpio_io   /*!< Signal name */
#define LED_BLUE_CHANNEL                                                     10U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define LED_BLUE_GPIO                                                     RGPIO1   /*!< GPIO peripheral base pointer */
#define LED_BLUE_INIT_GPIO_VALUE                                              0U   /*!< GPIO output initial state */
#define LED_BLUE_GPIO_PIN                                                    10U   /*!< GPIO pin number */
#define LED_BLUE_GPIO_PIN_MASK                                       (1U << 10U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_LED_BUTTON_Pins(void);        /* Function assigned for the Cortex-M33 */

/* GPIO_B1_06 (coord B10), DIGITAL_INPUT_05 */
/* Routed pin properties */
#define DIGITAL_INPUT_05_PERIPHERAL                                       RGPIO6   /*!< Peripheral name */
#define DIGITAL_INPUT_05_SIGNAL                                          gpio_io   /*!< Signal name */
#define DIGITAL_INPUT_05_CHANNEL                                              6U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define DIGITAL_INPUT_05_GPIO                                             RGPIO6   /*!< GPIO peripheral base pointer */
#define DIGITAL_INPUT_05_GPIO_PIN                                             6U   /*!< GPIO pin number */
#define DIGITAL_INPUT_05_GPIO_PIN_MASK                                (1U << 6U)   /*!< GPIO pin mask */

/* GPIO_B1_07 (coord D13), DIGITAL_INPUT_03 */
/* Routed pin properties */
#define DIGITAL_INPUT_03_PERIPHERAL                                       RGPIO6   /*!< Peripheral name */
#define DIGITAL_INPUT_03_SIGNAL                                          gpio_io   /*!< Signal name */
#define DIGITAL_INPUT_03_CHANNEL                                              7U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define DIGITAL_INPUT_03_GPIO                                             RGPIO6   /*!< GPIO peripheral base pointer */
#define DIGITAL_INPUT_03_GPIO_PIN                                             7U   /*!< GPIO pin number */
#define DIGITAL_INPUT_03_GPIO_PIN_MASK                                (1U << 7U)   /*!< GPIO pin mask */

/* GPIO_B1_08 (coord B14), DIGITAL_INPUT_02 */
/* Routed pin properties */
#define DIGITAL_INPUT_02_PERIPHERAL                                       RGPIO6   /*!< Peripheral name */
#define DIGITAL_INPUT_02_SIGNAL                                          gpio_io   /*!< Signal name */
#define DIGITAL_INPUT_02_CHANNEL                                              8U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define DIGITAL_INPUT_02_GPIO                                             RGPIO6   /*!< GPIO peripheral base pointer */
#define DIGITAL_INPUT_02_GPIO_PIN                                             8U   /*!< GPIO pin number */
#define DIGITAL_INPUT_02_GPIO_PIN_MASK                                (1U << 8U)   /*!< GPIO pin mask */

/* GPIO_B1_09 (coord A15), DIGITAL_INPUT_06 */
/* Routed pin properties */
#define DIGITAL_INPUT_06_PERIPHERAL                                       RGPIO6   /*!< Peripheral name */
#define DIGITAL_INPUT_06_SIGNAL                                          gpio_io   /*!< Signal name */
#define DIGITAL_INPUT_06_CHANNEL                                              9U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define DIGITAL_INPUT_06_GPIO                                             RGPIO6   /*!< GPIO peripheral base pointer */
#define DIGITAL_INPUT_06_GPIO_PIN                                             9U   /*!< GPIO pin number */
#define DIGITAL_INPUT_06_GPIO_PIN_MASK                                (1U << 9U)   /*!< GPIO pin mask */

/* GPIO_B1_10 (coord A13), DIGITAL_INPUT_07 */
/* Routed pin properties */
#define DIGITAL_INPUT_07_PERIPHERAL                                       RGPIO6   /*!< Peripheral name */
#define DIGITAL_INPUT_07_SIGNAL                                          gpio_io   /*!< Signal name */
#define DIGITAL_INPUT_07_CHANNEL                                             10U   /*!< Signal channel */

