pesaventoeil/rd-riop/common/m33/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define DIGITAL_INPUT_07_GPIO                                             RGPIO6   /*!< GPIO peripheral base pointer */
#define DIGITAL_INPUT_07_GPIO_PIN                                            10U   /*!< GPIO pin number */
#define DIGITAL_INPUT_07_GPIO_PIN_MASK                               (1U << 10U)   /*!< GPIO pin mask */

/* GPIO_B1_12 (coord A11), DIGITAL_INPUT_01 */
/* Routed pin properties */
#define DIGITAL_INPUT_01_PERIPHERAL                                       RGPIO6   /*!< Peripheral name */
#define DIGITAL_INPUT_01_SIGNAL                                          gpio_io   /*!< Signal name */
#define DIGITAL_INPUT_01_CHANNEL                                             12U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define DIGITAL_INPUT_01_GPIO                                             RGPIO6   /*!< GPIO peripheral base pointer */
#define DIGITAL_INPUT_01_GPIO_PIN                                            12U   /*!< GPIO pin number */
#define DIGITAL_INPUT_01_GPIO_PIN_MASK                               (1U << 12U)   /*!< GPIO pin mask */

/* GPIO_B1_13 (coord B11), DIGITAL_INPUT_04 */
/* Routed pin properties */
#define DIGITAL_INPUT_04_PERIPHERAL                                       RGPIO6   /*!< Peripheral name */
#define DIGITAL_INPUT_04_SIGNAL                                          gpio_io   /*!< Signal name */
#define DIGITAL_INPUT_04_CHANNEL                                             13U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define DIGITAL_INPUT_04_GPIO                                             RGPIO6   /*!< GPIO peripheral base pointer */
#define DIGITAL_INPUT_04_GPIO_PIN                                            13U   /*!< GPIO pin number */
#define DIGITAL_INPUT_04_GPIO_PIN_MASK                               (1U << 13U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_Digital_Input_Pins(void);     /* Function assigned for the Cortex-M33 */

/* GPIO_EMC_B1_21 (coord K4), DIGITAL_OUTPUT_01 */
/* Routed pin properties */
#define DIGITAL_OUTPUT_01_PERIPHERAL                                      RGPIO2   /*!< Peripheral name */
#define DIGITAL_OUTPUT_01_SIGNAL                                         gpio_io   /*!< Signal name */
#define DIGITAL_OUTPUT_01_CHANNEL                                            21U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define DIGITAL_OUTPUT_01_GPIO                                            RGPIO2   /*!< GPIO peripheral base pointer */
#define DIGITAL_OUTPUT_01_INIT_GPIO_VALUE                                     0U   /*!< GPIO output initial state */
#define DIGITAL_OUTPUT_01_GPIO_PIN                                           21U   /*!< GPIO pin number */
#define DIGITAL_OUTPUT_01_GPIO_PIN_MASK                              (1U << 21U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_22 (coord L3), DIGITAL_OUTPUT_02 */
/* Routed pin properties */
#define DIGITAL_OUTPUT_02_PERIPHERAL                                      RGPIO2   /*!< Peripheral name */
#define DIGITAL_OUTPUT_02_SIGNAL                                         gpio_io   /*!< Signal name */
#define DIGITAL_OUTPUT_02_CHANNEL                                            22U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define DIGITAL_OUTPUT_02_GPIO                                            RGPIO2   /*!< GPIO peripheral base pointer */
#define DIGITAL_OUTPUT_02_INIT_GPIO_VALUE                                     0U   /*!< GPIO output initial state */
#define DIGITAL_OUTPUT_02_GPIO_PIN                                           22U   /*!< GPIO pin number */
#define DIGITAL_OUTPUT_02_GPIO_PIN_MASK                              (1U << 22U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_23 (coord F1), DIGITAL_OUTPUT_03 */
/* Routed pin properties */
#define DIGITAL_OUTPUT_03_PERIPHERAL                                      RGPIO2   /*!< Peripheral name */
#define DIGITAL_OUTPUT_03_SIGNAL                                         gpio_io   /*!< Signal name */
#define DIGITAL_OUTPUT_03_CHANNEL                                            23U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define DIGITAL_OUTPUT_03_GPIO                                            RGPIO2   /*!< GPIO peripheral base pointer */
#define DIGITAL_OUTPUT_03_INIT_GPIO_VALUE                                     0U   /*!< GPIO output initial state */
#define DIGITAL_OUTPUT_03_GPIO_PIN                                           23U   /*!< GPIO pin number */
#define DIGITAL_OUTPUT_03_GPIO_PIN_MASK                              (1U << 23U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_24 (coord P2), DIGITAL_OUTPUT_04 */
/* Routed pin properties */
#define DIGITAL_OUTPUT_04_PERIPHERAL                                      RGPIO2   /*!< Peripheral name */
#define DIGITAL_OUTPUT_04_SIGNAL                                         gpio_io   /*!< Signal name */
#define DIGITAL_OUTPUT_04_CHANNEL                                            24U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define DIGITAL_OUTPUT_04_GPIO                                            RGPIO2   /*!< GPIO peripheral base pointer */
#define DIGITAL_OUTPUT_04_INIT_GPIO_VALUE                                     0U   /*!< GPIO output initial state */
#define DIGITAL_OUTPUT_04_GPIO_PIN                                           24U   /*!< GPIO pin number */
#define DIGITAL_OUTPUT_04_GPIO_PIN_MASK                              (1U << 24U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_25 (coord N3), DIGITAL_OUTPUT_05 */
/* Routed pin properties */
#define DIGITAL_OUTPUT_05_PERIPHERAL                                      RGPIO2   /*!< Peripheral name */
#define DIGITAL_OUTPUT_05_SIGNAL                                         gpio_io   /*!< Signal name */
#define DIGITAL_OUTPUT_05_CHANNEL                                            25U   /*!< Signal channel */

