pesaventoeil/rd-riop/common/m33/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define DIGITAL_OUTPUT_05_GPIO                                            RGPIO2   /*!< GPIO peripheral base pointer */
#define DIGITAL_OUTPUT_05_INIT_GPIO_VALUE                                     0U   /*!< GPIO output initial state */
#define DIGITAL_OUTPUT_05_GPIO_PIN                                           25U   /*!< GPIO pin number */
#define DIGITAL_OUTPUT_05_GPIO_PIN_MASK                              (1U << 25U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_26 (coord N4), DIGITAL_OUTPUT_06 */
/* Routed pin properties */
#define DIGITAL_OUTPUT_06_PERIPHERAL                                      RGPIO2   /*!< Peripheral name */
#define DIGITAL_OUTPUT_06_SIGNAL                                         gpio_io   /*!< Signal name */
#define DIGITAL_OUTPUT_06_CHANNEL                                            26U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define DIGITAL_OUTPUT_06_GPIO                                            RGPIO2   /*!< GPIO peripheral base pointer */
#define DIGITAL_OUTPUT_06_INIT_GPIO_VALUE                                     0U   /*!< GPIO output initial state */
#define DIGITAL_OUTPUT_06_GPIO_PIN                                           26U   /*!< GPIO pin number */
#define DIGITAL_OUTPUT_06_GPIO_PIN_MASK                              (1U << 26U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_27 (coord J3), DIGITAL_OUTPUT_07 */
/* Routed pin properties */
#define DIGITAL_OUTPUT_07_PERIPHERAL                                      RGPIO2   /*!< Peripheral name */
#define DIGITAL_OUTPUT_07_SIGNAL                                         gpio_io   /*!< Signal name */
#define DIGITAL_OUTPUT_07_CHANNEL                                            27U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define DIGITAL_OUTPUT_07_GPIO                                            RGPIO2   /*!< GPIO peripheral base pointer */
#define DIGITAL_OUTPUT_07_INIT_GPIO_VALUE                                     0U   /*!< GPIO output initial state */
#define DIGITAL_OUTPUT_07_GPIO_PIN                                           27U   /*!< GPIO pin number */
#define DIGITAL_OUTPUT_07_GPIO_PIN_MASK                              (1U << 27U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_28 (coord F5), DIGITAL_OUTPUT_08 */
/* Routed pin properties */
#define DIGITAL_OUTPUT_08_PERIPHERAL                                      RGPIO2   /*!< Peripheral name */
#define DIGITAL_OUTPUT_08_SIGNAL                                         gpio_io   /*!< Signal name */
#define DIGITAL_OUTPUT_08_CHANNEL                                            28U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define DIGITAL_OUTPUT_08_GPIO                                            RGPIO2   /*!< GPIO peripheral base pointer */
#define DIGITAL_OUTPUT_08_INIT_GPIO_VALUE                                     0U   /*!< GPIO output initial state */
#define DIGITAL_OUTPUT_08_GPIO_PIN                                           28U   /*!< GPIO pin number */
#define DIGITAL_OUTPUT_08_GPIO_PIN_MASK                              (1U << 28U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_Digital_Output_Pins(void);    /* Function assigned for the Cortex-M33 */

/* GPIO_AON_05 (coord C7), GPIO1_IO5 */
/* Routed pin properties */
#define AFE_CS_PERIPHERAL                                                 RGPIO1   /*!< Peripheral name */
#define AFE_CS_SIGNAL                                                    gpio_io   /*!< Signal name */
#define AFE_CS_CHANNEL                                                        5U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define AFE_CS_GPIO                                                       RGPIO1   /*!< GPIO peripheral base pointer */
#define AFE_CS_INIT_GPIO_VALUE                                                1U   /*!< GPIO output initial state */
#define AFE_CS_GPIO_PIN                                                       5U   /*!< GPIO pin number */
#define AFE_CS_GPIO_PIN_MASK                                          (1U << 5U)   /*!< GPIO pin mask */

/* GPIO_AON_04 (coord B4), LPSPI1_SCK */
/* Routed pin properties */
#define AFE_SPI_SCK_PERIPHERAL                                            LPSPI1   /*!< Peripheral name */
#define AFE_SPI_SCK_SIGNAL                                                   SCK   /*!< Signal name */

/* GPIO_AON_06 (coord E7), LPSPI1_SDO */
/* Routed pin properties */
#define AFE_SPI_MOSI_PERIPHERAL                                           LPSPI1   /*!< Peripheral name */
#define AFE_SPI_MOSI_SIGNAL                                                 SOUT   /*!< Signal name */

/* GPIO_AON_07 (coord C6), LPSPI1_SDI */
/* Routed pin properties */
#define AFE_SPI_MISO_PERIPHERAL                                           LPSPI1   /*!< Peripheral name */
#define AFE_SPI_MISO_SIGNAL                                                  SIN   /*!< Signal name */

/* GPIO_AD_15 (coord N16), GPIO4_IO15 */
/* Routed pin properties */
#define AFE_DRDY_PERIPHERAL                                               RGPIO4   /*!< Peripheral name */
#define AFE_DRDY_SIGNAL                                                  gpio_io   /*!< Signal name */
#define AFE_DRDY_CHANNEL                                                     15U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define AFE_DRDY_GPIO                                                     RGPIO4   /*!< GPIO peripheral base pointer */
#define AFE_DRDY_GPIO_PIN                                                    15U   /*!< GPIO pin number */
#define AFE_DRDY_GPIO_PIN_MASK                                       (1U << 15U)   /*!< GPIO pin mask */

/* GPIO_SD_B1_04 (coord B15), GPIO5_IO8 */
/* Routed pin properties */
#define AFE_RST_PERIPHERAL                                                RGPIO5   /*!< Peripheral name */
#define AFE_RST_SIGNAL                                                   gpio_io   /*!< Signal name */
#define AFE_RST_CHANNEL                                                       8U   /*!< Signal channel */

