pesaventoeil/rd-riop/common/m33/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define AFE_RST_GPIO                                                      RGPIO5   /*!< GPIO peripheral base pointer */
#define AFE_RST_INIT_GPIO_VALUE                                               0U   /*!< GPIO output initial state */
#define AFE_RST_GPIO_PIN                                                      8U   /*!< GPIO pin number */
#define AFE_RST_GPIO_PIN_MASK                                         (1U << 8U)   /*!< GPIO pin mask */

/* GPIO_SD_B1_03 (coord C15), GPIO5_IO7 */
/* Routed pin properties */
#define AFE_SYNC_PERIPHERAL                                               RGPIO5   /*!< Peripheral name */
#define AFE_SYNC_SIGNAL                                                  gpio_io   /*!< Signal name */
#define AFE_SYNC_CHANNEL                                                      7U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define AFE_SYNC_GPIO                                                     RGPIO5   /*!< GPIO peripheral base pointer */
#define AFE_SYNC_INIT_GPIO_VALUE                                              0U   /*!< GPIO output initial state */
#define AFE_SYNC_GPIO_PIN                                                     7U   /*!< GPIO pin number */
#define AFE_SYNC_GPIO_PIN_MASK                                        (1U << 7U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_AFE_Pins(void);               /* Function assigned for the Cortex-M33 */

/* GPIO_AD_26 (coord M14), FLEXPWM_2_1A */
/* Routed pin properties */
#define FLEXPWM_2_1A_PERIPHERAL                                             PWM2   /*!< Peripheral name */
#define FLEXPWM_2_1A_SIGNAL                                                    A   /*!< Signal name */
#define FLEXPWM_2_1A_CHANNEL                                                  1U   /*!< Signal channel */

/* GPIO_AD_27 (coord M16), FLEXPWM_2_1B */
/* Routed pin properties */
#define FLEXPWM_2_1B_PERIPHERAL                                             PWM2   /*!< Peripheral name */
#define FLEXPWM_2_1B_SIGNAL                                                    B   /*!< Signal name */
#define FLEXPWM_2_1B_CHANNEL                                                  1U   /*!< Signal channel */

/* GPIO_AD_28 (coord L16), FLEXPWM_2_2B */
/* Routed pin properties */
#define FLEXPWM_2_2B_PERIPHERAL                                             PWM2   /*!< Peripheral name */
#define FLEXPWM_2_2B_SIGNAL                                                    B   /*!< Signal name */
#define FLEXPWM_2_2B_CHANNEL                                                  2U   /*!< Signal channel */

/* GPIO_AD_29 (coord L15), FLEXPWM_2_2A */
/* Routed pin properties */
#define FLEXPWM_2_2A_PERIPHERAL                                             PWM2   /*!< Peripheral name */
#define FLEXPWM_2_2A_SIGNAL                                                    A   /*!< Signal name */
#define FLEXPWM_2_2A_CHANNEL                                                  2U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_PWM_Pins(void);               /* Function assigned for the Cortex-M33 */

/* GPIO_AD_18 (coord K16), ECAT_SCL */
/* Routed pin properties */
#define ECAT_SCL_PERIPHERAL                                                 ECAT   /*!< Peripheral name */
#define ECAT_SCL_SIGNAL                                                      SCL   /*!< Signal name */

/* GPIO_AD_19 (coord L13), ECAT_SDA */
/* Routed pin properties */
#define ECAT_SDA_PERIPHERAL                                                 ECAT   /*!< Peripheral name */
#define ECAT_SDA_SIGNAL                                                      SDA   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_ECAT_I2C_Pins(void);          /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
